ErpTest/src/Documents/пкДоставка/пкДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкДоставка</name>
  <comment>Доставка техники</comment>
  <registerRecords>AccumulationRegister.пкМоделиКДоставкеПоЗаявкамНаАрендуТехники</registerRecords>
  <registerRecords>AccumulationRegister.пкТехникаКПеремещениюМеждуРегионами</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРейсаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоРейсаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРейсаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеРейсаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоставкуВыполняет</name>
    <type>
      <types>EnumRef.ТипыИсполнителейЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействияДовернности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияДовернности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентЗагрузкиТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Д_Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Д_Документ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Д_ВодительПодпись</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияНаПеревозку</name>
    <attributes>
      <name>НомерХодки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеНаПеревозку</name>
      <type>
        <types>DocumentRef.пкЗаданиеНаПеревозку</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемоеВремяДоставки</name>
      <comment>Время, когда планируется выполнить доставку техники</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <type>
        <types>CatalogRef.ПричиныЗадержкиВыполненияЭтаповПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспортировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАренды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Documents/пкАктПриемкиВозврата/пкАктПриемкиВозврата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкАктПриемкиВозврата</name>
  <comment>Акты приемки/возврата техники</comment>
  <posting>Deny</posting>
  <attributes>
    <name>ПриемкаВозврат</name>
    <type>
      <types>EnumRef.пкПриемкаВозврат</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.пкДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерХодки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>пкПрикрепленыФайлыВДО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗаданияНаПеревозку</name>
    <attributes>
      <name>ЗаданиеНаПеревозку</name>
      <type>
        <types>DocumentRef.пкЗаданиеНаПеревозку</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаАрендуТехники</name>
      <type>
        <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспортировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАренды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Documents/пкДоставка/Forms/ФормаДобавитьЗаданиеВАкт/Module.bsl
///////////////////////////////////////////////////////////////////////
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаданиеНаПеревозку		= Параметры.ЗаданиеНаПеревозку;
	КлючДоставка			= Параметры.КлючДоставка;
	КлючНомерХодки			= Параметры.КлючНомерХодки;
	КлючПриемкаВозврат		= Параметры.КлючПриемкаВозврат;
	КлючПартнер				= Параметры.КлючПартнер;
	КлючДоговор				= Параметры.КлючДоговор;
	КлючОбъектСтроительства	= Параметры.КлючОбъектСтроительства;
	КлючАдресДоставки		= Параметры.КлючАдресДоставки;
	КлючКонтактноеЛицо		= Параметры.КлючКонтактноеЛицо;
	КлючПодразделение		= Параметры.КлючПодразделение;
	НовыйСуществующий		= Параметры.НовыйСуществующий;

	ТочкаМаршрута			= Параметры.ТочкаМаршрута;

	Транспортировка			= Параметры.Транспортировка;
	СтоимостьАренды			= Параметры.СтоимостьАренды;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.АктПриекиВозврата.Видимость = (НовыйСуществующий = 1);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура НовыйСуществующийПриИзменении(Элемент)
	Элементы.АктПриекиВозврата.Видимость = (НовыйСуществующий = 1);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ДобавиттьВАкт(Команда)
	
	Отказ = Ложь;
	
	Если НовыйСуществующий = 1 И Не ЗначениеЗаполнено(АктПриекиВозврата) Тогда
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = НСтр("ru='Не выбран Акт!'");
		тСообщение.Сообщить();
		Отказз = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВАктНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВАктНаСервере()
	
	Если НовыйСуществующий = 0 Тогда
		тОбъект = Документы.пкАктПриемкиВозврата.СоздатьДокумент();
		тОбъект.Дата = ЗаданиеНаПеревозку.ДатаОтгрузки;
		тОбъект.УстановитьНовыйНомер();
		тОбъект.Автор				= ПараметрыСеанса.ТекущийПользователь;
		тОбъект.Ответственный		= ПараметрыСеанса.ТекущийПользователь;
	Иначе
		тОбъект = АктПриекиВозврата.ПолучитьОбъект();
	КонецЕсли;
	
	//Добавим задание в Акт
	НоваяСтрока = тОбъект.ЗаданияНаПеревозку.Добавить();
	НоваяСтрока.ЗаданиеНаПеревозку		= ЗаданиеНаПеревозку;
	НоваяСтрока.ЗаявкаНаАрендуТехники	= ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники;
		
	//3. Обновляем/Заполняем Ключи в Акт
	тОбъект.Доставка			= КлючДоставка;
	тОбъект.ПриемкаВозврат 		= КлючПриемкаВозврат;
	тОбъект.НомерХодки			= КлючНомерХодки;
	тОбъект.Партнер				= КлючПартнер;
	тОбъект.Договор				= КлючДоговор;
	тОбъект.ОбъектСтроительства	= КлючОбъектСтроительства;
	тОбъект.АдресДоставки		= КлючАдресДоставки;
	тОбъект.КонтактноеЛицо		= КлючКонтактноеЛицо;
	тОбъект.Подразделение		= КлючПодразделение;
	
	тОбъект.ТочкаМаршрута		= ТочкаМаршрута;
	тОбъект.Комментарий			= ЗаданиеНаПеревозку.Комментарий;
	
	Для Каждого текСтрокаАкта Из тОбъект.ЗаданияНаПеревозку Цикл
		Если текСтрокаАкта.ЗаданиеНаПеревозку = ЗаданиеНаПеревозку Тогда
			текСтрокаАкта.Транспортировка	= Транспортировка;
			текСтрокаАкта.СтоимостьАренды	= СтоимостьАренды;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Попытка
		тОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
	Исключение
		тСообщение = Новый СообщениеПользователю;
		тСообщение.Текст = НСтр("ru='Ошибка формирования документа: '") + тОбъект.Ссылка + " " + ОписаниеОшибки();
		тСообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры
